{
  "id": "racas",
  "title": "Raças",
  "columns": ["Nome", "Livro"],
  "items": [
{
  "id": "anao",
  "name": "Anão",
  "book": "EdC",
  "img": "assets/imagens/racas/anao.webp",
  "blocks": [
    {
      "type": "p",
      "text": "Os anões erguem suas cidades próximas, coladas ou diretamente esculpidas nas montanhas. Suas sociedades valorizam tradição, laços familiares, resistência e o trabalho que atravessa gerações. Gemas, metais e símbolos ancestrais fazem parte do cotidiano, usados como adornos, marcas de linhagem e registros históricos."
    },
    {
      "type": "p",
      "text": "Fisicamente, são baixos e robustos, com corpos densos, ombros largos e traços firmes. Barbas, joias e vestimentas frequentemente exibem símbolos do clã, da família ou da cidade natal."
    },

    {
      "type": "rules",
      "items": [
        "Altura média: 1,30 m a 1,50 m",
        "Maturidade: cerca de 40 anos",
        "Idade média: 250 anos"
      ]
    },

    { "type": "h3", "text": "Habilidades Raciais" },

    {
      "type": "rules",
      "items": [
        "**Resiliência Ancestral:** 1 vez por cena, você pode reduzir pela metade o dano que receberia.",
        "**Corpo de Pedra:** você recebe +2 de Vida por Tier em que estiver."
      ]
    }
  ]
},
{
  "id": "elfo",
  "name": "Elfo",
  "book": "EdC",
  "img": "assets/imagens/racas/elfo.webp",
  "blocks": [
    {
      "type": "p",
      "text": "Os elfos estão entre os povos mais antigos do mundo. Eles se estabelecem em quase qualquer ambiente e, ao longo das gerações, passam a refletir o local onde vivem. Sua cultura é marcada por adaptação, longevidade e uma relação profunda com o ambiente ao redor."
    },
    {
      "type": "p",
      "text": "Elfos possuem corpos esguios, traços delicados e olhos expressivos. Pequenas variações físicas surgem conforme a região: tons de pele, marcas naturais ou detalhes sutis ligados ao ambiente."
    },
    {
      "type": "rules",
      "items": [
        "Altura média: 1,70 m a 1,90 m",
        "Maturidade: cerca de 70 anos",
        "Idade média: 600 anos"
      ]
    },
    { "type": "h3", "text": "Habilidades Raciais" },
    {
      "type": "rules",
      "items": [
        "**Filhos do Ambiente:** você tem vantagem em testes relacionados ao ambiente ou região onde foi criado.",
        "**Passos Eternos:** 1 vez por cena, você pode ignorar uma penalidade narrativa ligada a terreno, clima ou deslocamento."
      ]
    }
  ]
},
{
  "id": "gnomo",
  "name": "Gnomo",
  "book": "EdC",
  "img": "assets/imagens/racas/gnomo.webp",
  "blocks": [
    {
      "type": "p",
      "text": "Os gnomos são um povo pequeno, dedicado à agricultura, à criação de animais e ao cuidado da terra. Vivem em comunidades rurais organizadas, com forte senso de coletividade e amplo conhecimento prático sobre ciclos naturais."
    },
    {
      "type": "p",
      "text": "Fisicamente, são baixos, de mãos ágeis e corpos resistentes ao trabalho diário. Suas roupas costumam ser simples, funcionais e adaptadas à vida no campo."
    },
    {
      "type": "rules",
      "items": [
        "Altura média: 1,10 m a 1,30 m",
        "Maturidade: cerca de 25 anos",
        "Idade média: 150 anos"
      ]
    },
    { "type": "h3", "text": "Habilidades Raciais" },
    {
      "type": "rules",
      "items": [
        "**Trabalhador:** toda atividade de descanso concede 50% a mais de benefício.",
        "**Conhecimento da Terra:** você tem vantagem em testes ligados à agricultura, criação de animais, alimentos, clima e vida rural."
      ]
    }
  ]
},
{
  "id": "humano",
  "name": "Humano",
  "book": "EdC",
  "img": "assets/imagens/racas/humano.webp",
  "blocks": [
    {
      "type": "p",
      "text": "Os humanos são definidos por sua adaptabilidade. Eles surgem em praticamente qualquer lugar, moldando suas culturas conforme o ambiente, os conflitos e as oportunidades ao redor. Sua diversidade é sua maior força."
    },
    {
      "type": "p",
      "text": "Fisicamente, variam enormemente em aparência, altura e traços. Não existe um “padrão humano”: cada região desenvolve suas próprias características culturais e estéticas."
    },
    {
      "type": "rules",
      "items": [
        "Altura média: 1,60 m a 1,85 m",
        "Maturidade: cerca de 18 anos",
        "Idade média: 100 anos"
      ]
    },
    { "type": "h3", "text": "Habilidades Raciais" },
    {
      "type": "rules",
      "items": [
        "**Versatilidade Humana:** escolha 1 atributo; 1 vez por cena, você pode adicionar +2 a uma rolagem usando esse atributo.",
        "**Aprendizado Rápido:** você pode repetir um teste falhado 1 vez por cena."
      ]
    }
  ]
},
{
  "id": "orc",
  "name": "Orc",
  "book": "EdC",
  "img": "assets/imagens/racas/orc.webp",
  "blocks": [
    {
      "type": "p",
      "text": "Os orcs são um povo alto, forte e moldado pelo ambiente em que vive. Suas culturas variam conforme a região — desertos, tundras, selvas ou planícies geram tradições e aparências distintas. Apesar da fama de brutalidade, muitos orcs valorizam honra, comunidade e sobrevivência acima de tudo."
    },
    {
      "type": "p",
      "text": "Fisicamente, são imponentes e musculosos. A cor da pele, marcas naturais, presas e pinturas culturais variam de acordo com o território e a tradição local."
    },
    {
      "type": "rules",
      "items": [
        "Altura média: 1,90 m a 2,30 m",
        "Maturidade: cerca de 15 anos",
        "Idade média: 70 anos"
      ]
    },
    { "type": "h3", "text": "Habilidades Raciais" },
    {
      "type": "rules",
      "items": [
        "**Fúria Controlada:** 1 vez por cena, após sofrer dano, você pode ganhar vantagem na próxima ação de ataque.",
        "**Corpo Brutal:** você ignora a primeira penalidade narrativa causada por dor, ferimentos ou intimidação em uma cena."
      ]
    }
  ]
}
  ]
}